<?php
//============================================================+
// File name   : example_006.php
// Begin       : 2008-03-04
// Last Update : 2013-05-14
//
// Description : Example 006 for TCPDF class
//               WriteHTML and RTL support
//
// Author: Nicola Asuni
//
// (c) Copyright:
//               Nicola Asuni
//               Tecnick.com LTD
//               www.tecnick.com
//               info@tecnick.com
//============================================================+

/**
 * Creates an example PDF TEST document using TCPDF
 * @package com.tecnick.tcpdf
 * @abstract TCPDF - Example: WriteHTML and RTL support
 * @author Nicola Asuni
 * @since 2008-03-04
 */

// Include the main TCPDF library (search for installation path).
require_once('tcpdf_include.php');




// create new PDF document
$pdf = new TCPDF(PDF_PAGE_ORIENTATION, PDF_UNIT, PDF_PAGE_FORMAT, true, 'UTF-8', false);

// create new PDF document


// set document information
$pdf->setCreator(PDF_CREATOR);
$pdf->setAuthor('');
$pdf->setTitle('HRMS NDA');
$pdf->setSubject('');
$pdf->setKeywords('');

// set default header data

$pdf->setHeaderData(PDF_HEADER_LOGO, PDF_HEADER_LOGO_WIDTH, PDF_HEADER_TITLE.'', PDF_HEADER_STRING);

// set header and footer fonts
$pdf->setHeaderFont(Array(PDF_FONT_NAME_MAIN, '', PDF_FONT_SIZE_MAIN));



$pdf->setFooterFont(Array(PDF_FONT_NAME_DATA, '', PDF_FONT_SIZE_DATA));

// set default monospaced font
$pdf->setDefaultMonospacedFont(PDF_FONT_MONOSPACED);

// set margins
$pdf->setMargins(PDF_MARGIN_LEFT, PDF_MARGIN_TOP, PDF_MARGIN_RIGHT);
$pdf->setHeaderMargin(PDF_MARGIN_HEADER);
$pdf->setFooterMargin(PDF_MARGIN_FOOTER);

// set auto page breaks
$pdf->setAutoPageBreak(TRUE, PDF_MARGIN_BOTTOM);

// set image scale factor
$pdf->setImageScale(PDF_IMAGE_SCALE_RATIO);

// set some language-dependent strings (optional)
if (@file_exists(dirname(__FILE__).'/lang/eng.php')) {
	require_once(dirname(__FILE__).'/lang/eng.php');
	$pdf->setLanguageArray($l);
}

// ---------------------------------------------------------

// set font

$pdf->setFontSubsetting(true);

$fontpath1='../fonts/Aishwarya.TTF';
$fontmyraid  = TCPDF_FONTS::addTTFfont($fontpath1, 'TrueTypeUnicode', '', 96);
$pdf->SetFont(  $fontmyraid , '', 10);  

// $pdf->SetFont('freeserif', '', 10);
 // $pdf->setFont('dejavusans', '', 10);

// add a page
$pdf->AddPage();

// writeHTML($html, $ln=true, $fill=false, $reseth=false, $cell=false, $align='')
// writeHTMLCell($w, $h, $x, $y, $html='', $border=0, $ln=0, $fill=0, $reseth=true, $align='', $autopadding=true)

// create some HTML content
$html = '<h4>பணியாளர் நம்பகத்தன்மை மற்றும் வெளிப்படுத்தாத ஒப்பந்தம்</h4>

<p>நல்ல ஆலோசனையுடனும், சைன்மார்க்ஸ் இண்டஸ்ட்ரீஸ் இந்தியா பிரைவேட் லிமிடெட் (கம்பெனி) எனது வேலைவாய்ப்பு அல்லது தொடர்ச்சியான வேலைவாய்ப்பைக் கருத்தில் கொண்டு, அடியிற் கையொப்பமிட்ட</p>

<p>ஊழியர் நான் இந்த ஒப்பந்தத்தின் விதிமுறைகளை (“ஒப்பந்தம்”) ஒப்புக்கொள்கிறேன்:</p>

<h4>1. <u>ரகசிய தகவல்</u></h4>
<p><u>அ. நிறுவனத்தின் தகவல்</u> : எனது வேலைவாய்ப்பு காலத்திலும், அதன்பிறகு மூன்று வருட காலத்திலும், நிறுவனத்தின் நன்மை தவிர, அல்லது எந்தவொரு நபருக்கும், நிறுவனத்துக்கும் அல்லது நிறுவனத்தின் எழுத்துப்பூர்வ அங்கீகாரமின்றி இருக்கும் நிறுவனத்துக்கும், நிறுவனத்தின் எந்த ரகசிய தகவலும் நம்பிக்கையுடன் இருப்பதற்கும், எல்லா நேரங்களிலும் நம்பிக்கையுடன் இருக்க</p>

<p>நான் ஒப்புக்கொள்கிறேன்.எனக்கு புரிவது என்னவென்றால் “ரகசிய தகவல்” என்பது எந்தவொரு நிறுவனத்தின் தனியுரிம தகவல், தொழில்நுட்ப தரவு, வர்த்தக ரகசியங்கள் அல்லது ஆராய்ச்சி, தயாரிப்புத் திட்டங்கள், தயாரிப்புகள், சேவைகள், வாடிக்கையாளர் பட்டியல்கள், சந்தைகள், மென்பொருள், முன்னேற்றங்கள், கண்டுபிடிப்புகள் உள்ளிட்டவற்றை உள்ளடக்கியது, ஆனால் அவை மட்டுமல்ல. செயல்முறைகள், சூத்திரங்கள், தொழில்நுட்பம், வடிவமைப்புகள், வரைபடங்கள், பொறியியல், வன்பொருள் உள்ளமைவு தகவல், சந்தைப்படுத்தல், நிதி அல்லது நிறுவனம் எனக்கு நேரடியாகவோ அல்லது மறைமுகமாகவோ வெளிப்படுத்திய பிற வணிகத் தகவல்கள்.<p>

<p><u>ஆ. விதிவிலக்குகள்</u> : நான் நிரூபிக்கக்கூடிய ரகசிய தகவலின் பகுதிக்கு மேற்கூறிய கடமைகள் மற்றும் கட்டுப்பாடுகள் பொருந்தாது :</p>
<ul><li>கிடைத்தது அல்லது பொதுவாக பொதுமக்களுக்கு கிடைத்தது அல்லது</li>
    <li>கோரப்பட்டது அல்லது சட்டப்பூர்வமாக கட்டாயப்படுத்தப்பட்டது (வாய்வழி கேள்விகள், விசாரணையாளர்கள், தகவல் அல்லது ஆவணங்களுக்கான கோரிக்கைகள், சப்போனா, சிவில் அல்லது கிரிமினல் புலனாய்வு கோரிக்கை அல்லது ஒத்த செயல்முறை) அல்லது தடைசெய்யப்பட்ட எந்தவொரு வெளிப்பாட்டையும் செய்ய ஒரு ஒழுங்குமுறை அமைப்பு தேவைப்படுகிறது இல்லையெனில், இந்த ஒப்பந்தத்தால் கட்டுப்படுத்தப்பட்டால், நான் கட்டுப்படுவேன்.</li>
    <li>அத்தகைய எந்தவொரு கோரிக்கையையும் (களை) உடனடியாக அறிவித்து நிறுவனத்திற்கு வழங்குவதன் மூலம் நிறுவனம் பொருத்தமான பாதுகாப்பு உத்தரவு அல்லது பிற பொருத்தமான தீர்வுகளைத் தேடலாம் மற்றும்</li>

    <li>அத்தகைய பாதுகாப்பு உத்தரவைப் பெறுவதில் நிறுவனத்திற்கு நியாயமான உதவிகளை வழங்குதல். அத்தகைய பாதுகாப்பு உத்தரவு அல்லது பிற தீர்வுகள் பெறப்படாவிட்டால் அல்லது நிறுவனம் இங்கு தள்ளுபடியை வழங்கினால், ரகசிய தகவலின் அந்த பகுதியை (மற்றும் அந்த பகுதியை மட்டுமே) நான் வழங்கலாம், இது நிறுவனத்திற்கு நியாயமான முறையில் ஏற்றுக்கொள்ளக்கூடிய ஆலோசனையின் எழுத்துப்பூர்வ கருத்தில், நான் சட்டப்பூர்வமாக கட்டாயப்படுத்தப்பட்டது அல்லது வெளிப்படுத்த தேவைப்பட்டால்; வழங்கப்பட்டால், இரகசியத்தன்மை வெளிப்படுத்தப்படும் எந்தவொரு ரகசிய தகவலுக்கும் வழங்கப்படும் என்ற நம்பகமான உத்தரவாதத்தைப் பெற நியாயமான முயற்சிகளைப் பயன்படுத்துவேன்.</li>
</ul>
<p><u>இ. முன்னாள் வேலைவாய்ப்பு தகவல்</u> : நிறுவனத்துடனான எனது வேலையின் போது நான் ஒப்புக்கொள்வது என்னவென்றால், முறையற்ற முறையில் பயன்படுத்தக்கூடாதுஅல்லது எந்த தனியுரிம தகவலையும் வெளியிடவும் அல்லது எந்தவொரு முன்னாள் அல்லது ஒரே நேரத்தில் முதலாளியின் வர்த்தக இரகசியங்கள் அல்லது மற்ற நபர் அல்லது எந்தவொரு வெளியிடப்படாத ஆவணத்தையும் நிறுவனத்தின் வளாகத்திற்கு கொண்டு வரக்கூடாது அல்லது அத்தகைய எந்தவொரு முதலாளிக்கும் சொந்தமான தனியுரிம தகவல் அல்லது அத்தகைய முதலாளி, நபர் அல்லது நபர் அல்லது நிறுவனம் எழுத்துப்பூர்வமாக ஒப்புக் கொள்ளாவிட்டால்.</p>

<p><u>ஈ. மூன்றாம் தரப்பு தகவல்</u> : எதிர்காலத்தில் மூன்றாம் தரப்பினரிடமிருந்து அவர்களின் ரகசிய அல்லது தனியுரிம தகவல்களை சில வரையறுக்கப்பட்ட நோக்கங்களுக்காக மட்டுமே பயன்படுத்துவேன் என்பதை நான் உணர்கிறேன். இதுபோன்ற அனைத்து ரகசிய அல்லது தனியுரிம தகவல்களையும் கடுமையான நம்பிக்கையுடன் வைத்திருக்க ஒப்புக்கொள்கிறேன், அதை எந்தவொரு நபருக்கும், நிறுவனத்திற்கும் அல்லது நிறுவனத்திற்கும் வெளியிடக்கூடாது அல்லது அத்தகைய மூன்றாம் தரப்பினருடனான நிறுவனத்தின் உடன்படிக்கைக்கு இணங்க நிறுவனத்திற்காக எனது பணிகளை மேற்கொள்வதில் தேவையானதைத் தவிர அதைப் பயன்படுத்தக்கூடாது.</p>

<p><u>2. நிர்வாக பொருட்களை  திரும்ப பெறுதல்</u> : எனது வேலையில் இருந்து விலகும் போது,  நிறுவனத்தின் வணிகம் தொடர்பான அனைத்து ஆவணங்களும், அறிக்கைகள், சுருக்கங்கள், பட்டியல்கள், கடிதப் போக்குவரத்து, தகவல், கணினி கோப்புகள், கணினி வட்டுகள் மற்றும் நிறுவனத்துடன் எனது வேலையின் போது நான் பெற்ற மற்ற எல்லா பொருட்களும் மற்றும் அத்தகைய பொருட்களின் அனைத்து நகல்களும் திரும்ப ஒப்படைத்துவிடுவேன்.</p>

<p><u>3. சட்டபூர்வமான மற்றும் தகுதியான தீர்வுகள்</u> : இந்த ஒப்பந்தத்தின் எந்தவொரு விதிகளை மீறினாலும் தடை உத்தரவைப் பெற நிறுவனத்திற்கு உரிமை உண்டு என்பதையும் நான் உணர்கிறேன்.அத்தகைய போட்டி அல்லது வெளிப்பாட்டைத் தடுக்க ஒரு தடை உத்தரவு, குறிப்பிட்ட செயல்திறன் அல்லது பிற சமமான தீர்வைப் பெற நிறுவனத்திற்கு உரிமை உண்டு என்பதையும், மற்ற சட்ட தீர்வுகளுக்கு நிறுவனத்திற்கு உரிமை வழங்கலாம் என்பதையும் நான் உணர்கிறேன். வழக்கறிஞரின் கட்டணம் மற்றும் செலவுகள் உட்பட.</p>

<p><u>4. வாரிசுகள் மற்றும் பணிகள்</u> : இந்த ஒப்பந்தம் எனது வாரிசுகள், நிர்வாகிகள், நிர்வாகிகள் மற்றும் பிற சட்ட பிரதிநிதிகள் மீது கட்டுப்படும், மேலும் நிறுவனம், அதன் வாரிசுகள் மற்றும் அதன் பணியாளர்களின் நலனுக்காக இருக்கும். இந்த ஒப்பந்தத்தின் கீழ் எனது எந்தவொரு உரிமைகளையும் நான் ஒதுக்கவோ, அல்லது எனது கடமைகள் எதையும் ஒப்படைக்கவோ கூடாது.</p>

<p><u>5. தொடர் கடமைகள்</u> : இந்த ஒப்பந்தத்தில் விவரிக்கப்பட்டுள்ள கடமைகள் மற்றும் உரிமைகள் நிறுவனத்துடனான எனது வேலைவாய்ப்பு நிறுத்தப்படுவதைத் தக்கவைக்கும்.</p>

<p><u>6. சீர்திருத்தல்</u> : எப்போது வேண்டுமானாலும், இந்த ஒப்பந்தத்தின் ஒவ்வொரு ஏற்பாடும் பொருந்தக்கூடிய சட்டத்தின் கீழ் பயனுள்ளதாகவும் செல்லுபடியாகும் விதமாகவும் விளக்கப்படும், ஆனால் இந்த ஒப்பந்தத்தின் எந்தவொரு ஏற்பாடும் எந்தவொரு பொருந்தக்கூடிய சட்டம் அல்லது விதியின் கீழ் எந்த வகையிலும் செல்லாதது, சட்டவிரோதமானது அல்லது செயல்படுத்த முடியாதது எனக் கருதப்பட்டால் எந்தவொரு அதிகார வரம்பும், அத்தகைய செல்லுபடியாகாத தன்மை, சட்டவிரோதம் அல்லது செயல்படுத்த முடியாதது வேறு எந்த விதிமுறையையும் அல்லது வேறு எந்த அதிகார வரம்பையும் பாதிக்காது, ஆனால் இந்த ஒப்பந்தம் சீர்திருத்தப்பட்டு, கட்டாயப்படுத்தப்பட்டு, அத்தகைய அதிகார வரம்பில் செயல்படுத்தப்படும், இது போன்ற தவறான, சட்டவிரோத அல்லது செயல்படுத்த முடியாத விதிகள் இங்கு ஒருபோதும் இல்லாதது போல.</p>

<p><u>7. அரசு சட்டம்</u> : இந்த ஒப்பந்தம் சட்ட விதிகளின் முரண்பாடுகளைப் பொருட்படுத்தாமல் தமிழக மாநிலத்தின் சட்டங்களால் நிர்வகிக்கப்படும்.</p>

<p>சாட்சி அதற்கென்றே உள்ள தரப்புகள் இந்த ஒப்பந்தத்தை நிறைவேற்றுகின்றன</p>

<p></p><p></p>
<p style="text-align:justify;">
ஏற்றுக்கொள்வது/மற்றும் ஒப்புக்கொள்வது &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;செய்ன்மார்க்ஸ் இண்டஸ்ட்ரீஸ் (இ) பிரைவேட் லிமிடெட் 
</p>


<p></p>
<p></p>
<p></p>
<p style="text-align:justify;">
பணியாளரின் பெயர் / கையொப்பம்&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;மேலாளர் கையொப்பம்
</p>';

// output the HTML content
$pdf->writeHTML($html, true, false, true, false, '');


// - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

// reset pointer to the last page
$pdf->lastPage();

// ---------------------------------------------------------

//Close and output PDF document
$pdf->Output('example_006.pdf', 'I');

//============================================================+
// END OF FILE
//============================================================+
